[
    {
        "title": "The Shawshank Redemption",
        "year": 1994,
        "rating": 9.3,
        "directors": [
            "Frank Darabont"
        ],
        "cast": [
            "Tim Robbins",
            "Morgan Freeman",
            "Bob Gunton",
            "William Sadler",
            "Clancy Brown",
            "Gil Bellows",
            "Mark Rolston",
            "James Whitmore",
            "Jeffrey DeMunn",
            "Larry Brandenburg"
        ],
        "genres": [
            "Drama"
        ],
        "plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red."
    },
    {
        "title": "The Godfather",
        "year": 1972,
        "rating": 9.2,
        "directors": [
            "Francis Ford Coppola"
        ],
        "cast": [
            "Marlon Brando",
            "Al Pacino",
            "James Caan",
            "Richard S. Castellano",
            "Robert Duvall",
            "Sterling Hayden",
            "John Marley",
            "Richard Conte",
            "Al Lettieri",
            "Diane Keaton"
        ],
        "genres": [
            "Crime",
            "Drama"
        ],
        "plot": "The Godfather \"Don\" Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WWII Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart."
    },
    {
        "title": "The Dark Knight",
        "year": 2008,
        "rating": 9.0,
        "directors": [
            "Christopher Nolan"
        ],
        "cast": [
            "Christian Bale",
            "Heath Ledger",
            "Aaron Eckhart",
            "Michael Caine",
            "Maggie Gyllenhaal",
            "Gary Oldman",
            "Morgan Freeman",
            "Monique Gabriela Curnen",
            "Ron Dean",
            "Cillian Murphy"
        ],
        "genres": [
            "Action",
            "Crime",
            "Drama",
            "Thriller"
        ],
        "plot": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as \"The Joker\" appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes."
    },
    {
        "title": "The Godfather Part II",
        "year": 1974,
        "rating": 9.0,
        "directors": [
            "Francis Ford Coppola"
        ],
        "cast": [
            "Al Pacino",
            "Robert Duvall",
            "Diane Keaton",
            "Robert De Niro",
            "John Cazale",
            "Talia Shire",
            "Lee Strasberg",
            "Michael V. Gazzo",
            "G.D. Spradlin",
            "Richard Bright"
        ],
        "genres": [
            "Crime",
            "Drama"
        ],
        "plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba."
    },
    {
        "title": "12 Angry Men",
        "year": 1957,
        "rating": 9.0,
        "directors": [
            "Sidney Lumet"
        ],
        "cast": [
            "Martin Balsam",
            "John Fiedler",
            "Lee J. Cobb",
            "E.G. Marshall",
            "Jack Klugman",
            "Edward Binns",
            "Jack Warden",
            "Henry Fonda",
            "Joseph Sweeney",
            "Ed Begley"
        ],
        "genres": [
            "Crime",
            "Drama"
        ],
        "plot": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room."
    },
    {
        "title": "Schindler's List",
        "year": 1993,
        "rating": 9.0,
        "directors": [
            "Steven Spielberg"
        ],
        "cast": [
            "Liam Neeson",
            "Ben Kingsley",
            "Ralph Fiennes",
            "Caroline Goodall",
            "Jonathan Sagall",
            "Embeth Davidtz",
            "Malgorzata Gebel",
            "Shmuel Levy",
            "Mark Ivanir",
            "Béatrice Macola"
        ],
        "genres": [
            "Biography",
            "Drama",
            "History"
        ],
        "plot": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us."
    },
    {
        "title": "The Lord of the Rings: The Return of the King",
        "year": 2003,
        "rating": 9.0,
        "directors": [
            "Peter Jackson"
        ],
        "cast": [
            "Noel Appleby",
            "Ali Astin",
            "Sean Astin",
            "David Aston",
            "John Bach",
            "Sean Bean",
            "Cate Blanchett",
            "Orlando Bloom",
            "Billy Boyd",
            "Sadwyn Brophy"
        ],
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith."
    },
    {
        "title": "Pulp Fiction",
        "year": 1994,
        "rating": 8.9,
        "directors": [
            "Quentin Tarantino"
        ],
        "cast": [
            "Tim Roth",
            "Amanda Plummer",
            "Laura Lovelace",
            "John Travolta",
            "Samuel L. Jackson",
            "Phil LaMarr",
            "Frank Whaley",
            "Burr Steers",
            "Bruce Willis",
            "Ving Rhames"
        ],
        "genres": [
            "Crime",
            "Drama"
        ],
        "plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hitmen who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents."
    },
    {
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "year": 2001,
        "rating": 8.9,
        "directors": [
            "Peter Jackson"
        ],
        "cast": [
            "Alan Howard",
            "Noel Appleby",
            "Sean Astin",
            "Sala Baker",
            "Sean Bean",
            "Billy Boyd",
            "Andy Serkis",
            "Marton Csokas",
            "Viggo Mortensen",
            "Orlando Bloom"
        ],
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "plot": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign."
    },
    {
        "title": "The Good, the Bad and the Ugly",
        "year": 1966,
        "rating": 8.8,
        "directors": [
            "Sergio Leone"
        ],
        "cast": [
            "Eli Wallach",
            "Clint Eastwood",
            "Lee Van Cleef",
            "Aldo Giuffrè",
            "Luigi Pistilli",
            "Rada Rassimov",
            "Enzo Petito",
            "Claudio Scarchilli",
            "John Bartha",
            "Livio Lorenzon"
        ],
        "genres": [
            "Adventure",
            "Drama",
            "Western"
        ],
        "plot": "During the American Civil War, three men set off to find $200,000.00 in buried gold coins. Tuco and Blondie have known each other for some time now, having used the reward on Tuco's head as a way of earning money. They come across a dying man, Bill Carson, who tells them of a treasure in gold coins. By chance, he reveals the name of the cemetery and the name of the grave where the gold is buried. Now rivals, the two men have good reason to keep each other alive. The third man, Angel Eyes, hears of the gold stash from someone he's been hired to kill. All he knows is to look for someone named Bill Carson. The three ultimately meet in a showdown that takes place amid a major battle between Confederate and Union forces."
    },
    {
        "title": "Forrest Gump",
        "year": 1994,
        "rating": 8.8,
        "directors": [
            "Robert Zemeckis"
        ],
        "cast": [
            "Tom Hanks",
            "Rebecca Williams",
            "Sally Field",
            "Michael Conner Humphreys",
            "Harold G. Herthum",
            "George Kelly",
            "Bob Penny",
            "John Randall",
            "Sam Anderson",
            "Margo Moorer"
        ],
        "genres": [
            "Drama",
            "Romance"
        ],
        "plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone."
    },
    {
        "title": "The Lord of the Rings: The Two Towers",
        "year": 2002,
        "rating": 8.8,
        "directors": [
            "Peter Jackson"
        ],
        "cast": [
            "Bruce Allpress",
            "Sean Astin",
            "John Bach",
            "Sala Baker",
            "Cate Blanchett",
            "Orlando Bloom",
            "Billy Boyd",
            "Jed Brophy",
            "Sam Comery",
            "Brad Dourif"
        ],
        "genres": [
            "Action",
            "Adventure",
            "Drama",
            "Fantasy"
        ],
        "plot": "The continuing quest of Frodo and the Fellowship to destroy the One Ring. Frodo and Sam discover they are being followed by the mysterious Gollum. Aragorn, the Elf archer Legolas, and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell."
    },
    {
        "title": "Fight Club",
        "year": 1999,
        "rating": 8.8,
        "directors": [
            "David Fincher"
        ],
        "cast": [
            "Edward Norton",
            "Brad Pitt",
            "Meat Loaf",
            "Zach Grenier",
            "Richmond Arquette",
            "David Andrews",
            "George Maguire",
            "Eugenie Bondurant",
            "Christina Cabot",
            "Helena Bonham Carter"
        ],
        "genres": [
            "Drama"
        ],
        "plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power."
    },
    {
        "title": "Inception",
        "year": 2010,
        "rating": 8.8,
        "directors": [
            "Christopher Nolan"
        ],
        "cast": [
            "Leonardo DiCaprio",
            "Joseph Gordon-Levitt",
            "Elliot Page",
            "Tom Hardy",
            "Ken Watanabe",
            "Dileep Rao",
            "Cillian Murphy",
            "Tom Berenger",
            "Marion Cotillard",
            "Pete Postlethwaite"
        ],
        "genres": [
            "Action",
            "Adventure",
            "Sci-Fi",
            "Thriller"
        ],
        "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming."
    },
    {
        "title": "Star Wars: Episode V - The Empire Strikes Back",
        "year": 1980,
        "rating": 8.7,
        "directors": [
            "Irvin Kershner"
        ],
        "cast": [
            "Mark Hamill",
            "Harrison Ford",
            "Carrie Fisher",
            "Billy Dee Williams",
            "Anthony Daniels",
            "David Prowse",
            "Peter Mayhew",
            "Kenny Baker",
            "Frank Oz",
            "Alec Guinness"
        ],
        "genres": [
            "Action",
            "Adventure",
            "Fantasy",
            "Sci-Fi"
        ],
        "plot": "The legendary saga continues as the Rebel Alliance faces increasing challenges from the powerful Galactic Empire. Luke Skywalker, Han Solo, and Princess Leia Organa find themselves confronting new trials that test their courage, friendships, and beliefs. The Rebel Alliance has established a hidden base on the icy planet of Hoth, where they hope to regroup and plan their next moves against the Empire. Luke Skywalker receives a message from a familiar source, prompting him to seek further guidance in understanding his connection to the Force. Han Solo and Princess Leia's journey takes them on a perilous path as they navigate through a galaxy under Imperial control. Their actions and decisions lead to unforeseen consequences that will impact the fate of the Rebellion. Meanwhile, the dark presence of Darth Vader looms, as he relentlessly pursues the Rebels while dealing with inner conflicts of his own."
    },
    {
        "title": "The Matrix",
        "year": 1999,
        "rating": 8.7,
        "directors": [
            "Lana Wachowski",
            "Lilly Wachowski"
        ],
        "cast": [
            "Keanu Reeves",
            "Laurence Fishburne",
            "Carrie-Anne Moss",
            "Hugo Weaving",
            "Gloria Foster",
            "Joe Pantoliano",
            "Marcus Chong",
            "Julian Arahanga",
            "Matt Doran",
            "Belinda McClory"
        ],
        "genres": [
            "Action",
            "Sci-Fi"
        ],
        "plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion."
    },
    {
        "title": "Goodfellas",
        "year": 1990,
        "rating": 8.7,
        "directors": [
            "Martin Scorsese"
        ],
        "cast": [
            "Robert De Niro",
            "Ray Liotta",
            "Joe Pesci",
            "Lorraine Bracco",
            "Paul Sorvino",
            "Frank Sivero",
            "Tony Darrow",
            "Mike Starr",
            "Frank Vincent",
            "Chuck Low"
        ],
        "genres": [
            "Biography",
            "Crime",
            "Drama"
        ],
        "plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?"
    },
    {
        "title": "One Flew Over the Cuckoo's Nest",
        "year": 1975,
        "rating": 8.7,
        "directors": [
            "Milos Forman"
        ],
        "cast": [
            "Michael Berryman",
            "Peter Brocco",
            "Dean R. Brooks",
            "Alonzo Brown",
            "Scatman Crothers",
            "Mwako Cumbuka",
            "Danny DeVito",
            "William Duell",
            "Josip Elic",
            "Lan Fendors"
        ],
        "genres": [
            "Drama"
        ],
        "plot": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse."
    },
    {
        "title": "Se7en",
        "year": 1995,
        "rating": 8.6,
        "directors": [
            "David Fincher"
        ],
        "cast": [
            "Morgan Freeman",
            "Andrew Kevin Walker",
            "Daniel Zacapa",
            "Brad Pitt",
            "Gwyneth Paltrow",
            "John Cassini",
            "Bob Mack",
            "Peter Crombie",
            "Reg E. Cathey",
            "R. Lee Ermey"
        ],
        "genres": [
            "Crime",
            "Drama",
            "Mystery",
            "Thriller"
        ],
        "plot": "A film about two homicide detectives' (Morgan Freeman and Brad Pitt) desperate hunt for a serial killer who justifies his crimes as absolution for the world's ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" (Kevin Spacey) sermonizes to Detectives Somerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer's terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Somerset researches the Seven Deadly Sins in an effort to understand the killer's modus operandi while the bright but green and impulsive Detective Mills (Pitt) scoffs at his efforts to get inside the mind of a killer..."
    },
    {
        "title": "Interstellar",
        "year": 2014,
        "rating": 8.7,
        "directors": [
            "Christopher Nolan"
        ],
        "cast": [
            "Ellen Burstyn",
            "Matthew McConaughey",
            "Mackenzie Foy",
            "John Lithgow",
            "Timothée Chalamet",
            "David Oyelowo",
            "Collette Wolfe",
            "Francis X. McCarthy",
            "Bill Irwin",
            "Anne Hathaway"
        ],
        "genres": [
            "Adventure",
            "Drama",
            "Sci-Fi"
        ],
        "plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life."
    },
    {
        "title": "It's a Wonderful Life",
        "year": 1946,
        "rating": 8.6,
        "directors": [
            "Frank Capra"
        ],
        "cast": [
            "James Stewart",
            "Donna Reed",
            "Lionel Barrymore",
            "Thomas Mitchell",
            "Henry Travers",
            "Beulah Bondi",
            "Frank Faylen",
            "Ward Bond",
            "Gloria Grahame",
            "H.B. Warner"
        ],
        "genres": [
            "Drama",
            "Family",
            "Fantasy",
            "Romance"
        ],
        "plot": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Mr. Potter finds the misplaced money and hides it from Uncle Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Mr. Potter to take over the town. Thinking of his wife, Mary, their four children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in his guardian angel named Clarence Odbody coming to Earth to help him, with the promise of earning his wings. He shows him what things would have been like if he had never been born."
    },
    {
        "title": "Seven Samurai",
        "year": 1954,
        "rating": 8.6,
        "directors": [
            "Akira Kurosawa"
        ],
        "cast": [
            "Toshirô Mifune",
            "Takashi Shimura",
            "Keiko Tsushima",
            "Yukiko Shimazaki",
            "Kamatari Fujiwara",
            "Daisuke Katô",
            "Isao Kimura",
            "Minoru Chiaki",
            "Seiji Miyaguchi",
            "Yoshio Kosugi"
        ],
        "genres": [
            "Action",
            "Drama"
        ],
        "plot": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village."
    },
    {
        "title": "The Silence of the Lambs",
        "year": 1991,
        "rating": 8.6,
        "directors": [
            "Jonathan Demme"
        ],
        "cast": [
            "Jodie Foster",
            "Anthony Hopkins",
            "Scott Glenn",
            "Ted Levine",
            "Anthony Heald",
            "Brooke Smith",
            "Diane Baker",
            "Kasi Lemmons",
            "Charles Napier",
            "Tracey Walter"
        ],
        "genres": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "plot": "F.B.I. trainee Clarice Starling (Jodie Foster) works hard to advance her career, while trying to hide or put behind her West Virginia roots, of which if some knew, would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford (Scott Glenn). While she is still a trainee, Crawford asks her to question Dr. Hannibal Lecter (Sir Anthony Hopkins), a psychiatrist imprisoned, thus far, for eight years in maximum security isolation for being a serial killer who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as \"Buffalo Bill\" (Ted Levine), who has so far killed five victims, all located in the eastern U.S., all young women, who are slightly overweight (especially around the hips), all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her, as a woman, to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game, with her often having to read between the very cryptic lines he provides. She has to decide how much she will play along, as his request in return for talking to him is to expose herself emotionally to him. The case takes a more dire turn when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence, if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin (Brooke Smith), the daughter of Senator Ruth Martin (Diane Baker), which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton (Anthony Heald), the warden at the prison, an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings."
    },
    {
        "title": "Saving Private Ryan",
        "year": 1998,
        "rating": 8.6,
        "directors": [
            "Steven Spielberg"
        ],
        "cast": [
            "Tom Hanks",
            "Tom Sizemore",
            "Edward Burns",
            "Barry Pepper",
            "Adam Goldberg",
            "Vin Diesel",
            "Giovanni Ribisi",
            "Jeremy Davies",
            "Matt Damon",
            "Ted Danson"
        ],
        "genres": [
            "Drama",
            "War"
        ],
        "plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother..."
    },
    {
        "title": "City of God",
        "year": 2002,
        "rating": 8.6,
        "directors": [
            "Fernando Meirelles",
            "Kátia Lund"
        ],
        "cast": [
            "Alexandre Rodrigues",
            "Leandro Firmino",
            "Phellipe Haagensen",
            "Douglas Silva",
            "Jonathan Haagensen",
            "Matheus Nachtergaele",
            "Seu Jorge",
            "Jefechander Suplino",
            "Alice Braga",
            "Emerson Gomes"
        ],
        "genres": [
            "Crime",
            "Drama"
        ],
        "plot": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God."
    }
]